---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.WallNominalThickness
source: html/77f654b8-0991-b11d-6cc0-20d6b2eaa277.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR.WallNominalThickness Property

Represents wall nominal thickness of rectangle.

## Syntax (C#)
```csharp
public double WallNominalThickness { get; set; }
```

## Remarks
Nominal is measured real value of profile, should be thicker than designed.
 In EN standard it is marked as "d". //Need to be verified!!!!!!!
 In ACI standard it is marked as "d". //Need to be verified!!!!!!!